{
  "services": [
    {
      "id": "electrical-schema",
      "title": "Electrical Engineering & Schema Design",
      "icon": "Zap",
      "tools": ["AutoCAD", "EPLAN"],
      "short": "IEC/NEC compliant electrical schematics, panel layouts, and comprehensive wiring documentation for industrial control systems.",
      "long": "Professional electrical engineering services including single-line and multi-line schematics, control panel layouts, wiring diagrams, bill of materials (BOM) generation, and terminal mapping. Utilizing industry-standard AutoCAD and EPLAN software to deliver DWG/EDX exports, CSV BOMs, and complete PLC I/O mapping documentation."
    },
    {
      "id": "plc-scada",
      "title": "PLC & SCADA Development",
      "icon": "Cpu",
      "tools": ["Ignition", "Rockwell", "Siemens"],
      "short": "Enterprise-grade PLC programming, SCADA/HMI development, alarm management, and real-time data historization solutions.",
      "long": "Comprehensive control system development including PLC logic programming, intuitive HMI/SCADA interfaces, intelligent alarm strategies, and robust historian tag models. Implementation follows industry best practices for safety interlocks, modular program architecture, secure remote access, and version control management."
    },
    {
      "id": "database-schema",
      "title": "Industrial Database Architecture",
      "icon": "Database",
      "tools": ["SQL", "Time-series DBs", "Canary"],
      "short": "Optimized relational and time-series database design for manufacturing execution systems and process data management.",
      "long": "Expert database architecture services featuring normalized relational schemas and high-performance time-series databases for historians and MES integrations. Comprehensive implementation of backup/retention policies, indexing strategies, partitioning, and ETL pipelines to enable advanced analytics and reporting capabilities."
    },
    {
      "id": "site-commissioning",
      "title": "Commissioning & Field Services",
      "icon": "Settings",
      "tools": ["Field Testing", "Onsite Support"],
      "short": "Professional on-site commissioning, factory/site acceptance testing, loop verification, and comprehensive operator training programs.",
      "long": "Complete commissioning services including pre-commissioning verification, FAT/SAT coordination, loop testing, site acceptance validation, and hands-on operator training. Deliverables include detailed commissioning documentation, punch-list management, and post-commissioning support."
    },
    {
      "id": "migration",
      "title": "System Migration & Modernization",
      "icon": "RefreshCw",
      "tools": ["Legacy -> Modern", "Data Migration"],
      "short": "Seamless migration from legacy control systems to modern platforms with minimal downtime and comprehensive data preservation.",
      "long": "Strategic planning and execution of control system migrations from legacy SCADA/PLC/Historian platforms to modern solutions. Services include phased cutover planning, data reconciliation, comprehensive tag mapping, rollback contingency plans, and minimal production disruption."
    },
    {
      "id": "ai-ml",
      "title": "AI/ML Analytics & Predictive Maintenance",
      "icon": "Brain",
      "tools": ["Python", "TensorFlow", "ML Ops"],
      "short": "Advanced machine learning solutions for predictive maintenance, anomaly detection, and industrial process optimization.",
      "long": "End-to-end AI/ML implementation from data ingestion to model deployment. Services include feature engineering, time-series forecasting, anomaly detection algorithms, and MLOps pipelines for predictive maintenance and process optimization. Integration with real-time dashboards and edge inferencing capabilities."
    },
    {
      "id": "iot",
      "title": "Industrial IoT Solutions",
      "icon": "Wifi",
      "tools": ["MQTT", "Edge Gateways", "Cloud"],
      "short": "Secure edge-to-cloud IoT architectures with device management, real-time telemetry, and scalable data pipelines.",
      "long": "Comprehensive IoT system design featuring secure edge gateways, MQTT messaging protocols (HiveMQ-compatible), device provisioning and management, over-the-air (OTA) updates, and seamless cloud integration for telemetry collection and remote device control."
    },
    {
      "id": "digital-twin",
      "title": "Digital Twin Technology",
      "icon": "Copy",
      "tools": ["AnyLogic", "Unity", "Three.js"],
      "short": "High-fidelity digital replicas for process simulation, what-if analysis, and virtual operator training environments.",
      "long": "Advanced digital twin development creating synchronized virtual replicas of physical processes. Enables simulation-based optimization, what-if scenario analysis, and immersive operator training. Real-time integration with live process data drives 3D visualizations using Unity, Three.js, and AnyLogic platforms."
    },
    {
      "id": "embedded",
      "title": "Embedded Systems Engineering",
      "icon": "Microchip",
      "tools": ["Arduino", "ESP32", "Custom Firmware"],
      "short": "Custom embedded hardware and firmware development for industrial sensors, controllers, and edge computing devices.",
      "long": "Specialized embedded system design and implementation including firmware development, hardware prototyping for sensing and control applications, and edge computing solutions. Services include PCB-level integration and production-ready firmware for industrial environments."
    },
    {
      "id": "dynamics365",
      "title": "Dynamics 365 Integration",
      "icon": "Building2",
      "tools": ["Dynamics 365", "Power Platform"],
      "short": "Enterprise CRM customization and integration with field service operations and asset management systems.",
      "long": "Microsoft Dynamics 365 customization for Field Service and Operations modules. Implementation includes asset lifecycle management, work order automation, technician dispatch optimization, and seamless integration with operational data sources and industrial systems."
    },
    {
      "id": "vision",
      "title": "Machine Vision Systems",
      "icon": "Eye",
      "tools": ["OpenCV", "Industrial Cameras"],
      "short": "Intelligent vision systems for quality inspection, alignment verification, and automated guidance applications.",
      "long": "Compact machine vision solutions for inspection, alignment, and guidance applications. Implementation includes edge camera integration, optimized computer vision models, and robust lighting and optics design for reliable performance in industrial environments."
    },
    {
      "id": "labview",
      "title": "LabVIEW Development",
      "icon": "Activity",
      "tools": ["NI LabVIEW", "TestStand"],
      "short": "Automated test systems, data acquisition platforms, and custom instrumentation interfaces for R&D and production.",
      "long": "Professional LabVIEW application development for automated testing, high-speed data acquisition, instrument control, and comprehensive reporting systems. Modular VI architecture ensures maintainability and scalability for complex test and measurement applications."
    },
    {
      "id": "historian",
      "title": "Historian Implementation",
      "icon": "BarChart3",
      "tools": ["Canary", "OSISoft PI"],
      "short": "Enterprise historian architecture with optimized data retention, aggregation strategies, and high-performance querying.",
      "long": "Industrial historian design and implementation featuring comprehensive tag models, intelligent retention and aggregation policies, and optimized query patterns. Solutions support long-term data storage, advanced analytics, and real-time operational intelligence."
    },
    {
      "id": "3d-simulation",
      "title": "3D Process Simulation",
      "icon": "Box",
      "tools": ["Unity", "AnyLogic", "Blender"],
      "short": "Interactive 3D simulations for process validation, facility layout optimization, and logistics flow analysis.",
      "long": "Immersive 3D simulation development for process validation, operator training, and facility layout optimization. Platforms include Unity and AnyLogic with support for scenario playback, KPI visualization, and integration with real-time operational data."
    }
  ]
}
